AJAXTwitter/skeleton/app/views/tweets/_form.html.erb

SELECT "users".* FROM "users"
---
        <select name ="tweet[mentioned_user_ids][]">
          <% User.all.each do |user| %>