AJAXTwitter/skeleton/app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "tweet 1"], ["created_at", "2017-05-13 16:07:05.891427"], ["updated_at", "2017-05-13 16:07:05.891427"], ["user_id", 8]]